// Text-based Console Video (텍스트 기반 콘솔 화상)

const fs = require('fs');

var ret = [];

ret[0] = 0x54;  // 식별자(TCV)
ret[1] = 0x43;
ret[2] = 0x56;

ret[3] = 0x20;  // 띄어쓰기

ret[4] = 101;  // 작성 프로그램(101: Node.js)
ret[5] = 16;  // 작성 버전(11부터)

ret.push(100);  // 프레임 구분 기호(100: LF)

ret.push(17);  // 프레임 줄 수

ret.push(7);  // 프래임 수

ret.push(3);  // 프래임 간격(1-255, 1 => 0.1초, 10 => 1초, 255 => 2550초)

ret.push(0);  // 위쪽여백

ret.push(0);  // 오른쪽여백

ret.push(255);  // 반복수(255: 무한)

ret.push(0);  // 출력 후 지우기(1: 예)

ret.push(0x1);  // 헤더 끝

ret.push(0xA);  // 줄 바꾸기

var frms = [
"\
                                                                 \n\
                                                    \n\
                                                      \n\
                                                    \n\
                                                \n\
                          ＿--￣￣￣――--＿                    \n\
                         /                \\                    \n\
                        /                  \\                   \n\
                       |      _            |                  \n\
                       |     / \\           |                  \n\
                        \\    \\_/           /                   \n\
                         \\                /                    \n\
                          ￣--＿＿＿――--￣                    \n\
                                                                 \n\
                                                                 \n\
                  엔                                             \n\
                                                                \
", "\
                                                                 \n\
                                                    \n\
                                                      \n\
                                                    \n\
                                                \n\
                          ＿--  ￣￣――--＿                    \n\
                         /    |           \\                    \n\
                        /      \\           \\                   \n\
                       |        \\          |                  \n\
                       |        /          |                  \n\
                        \\       \\          /                   \n\
                         \\                /                    \n\
                          ￣--＿＿＿――--￣                    \n\
                                                                 \n\
                                                                 \n\
                  엔 진                                          \n\
                                                                \
", "\
                                                                 \n\
                                                    \n\
                                                      \n\
                                                    \n\
                                                \n\
                          ＿--  ￣￣――--＿                    \n\
                         /    |      _    \\                    \n\
                        /      \\    /      \\                   \n\
                       |        \\__/       |                  \n\
                       |        /  \\__     |                  \n\
                        \\       \\          /                   \n\
                         \\      /         /                    \n\
                          ￣--＿＿＿――--￣                    \n\
                                                                 \n\
                                                                 \n\
                  엔 진    시                                    \n\
                                                                \
", "\
                                                                 \n\
                                                    \n\
                                                      \n\
                                                    \n\
                                                \n\
                          ＿--  ￣￣――--                      \n\
                         /    |      __   \\                    \n\
                        /      \\    /      \\                   \n\
                       |        \\__/       |                  \n\
                       |        /  \\__     |                  \n\
                                \\          /                   \n\
                              __/         /                    \n\
                                ＿＿――--￣                    \n\
                                                                 \n\
                                                                 \n\
                  엔 진    시 작                                 \n\
                                                                \
", "\
                                                                 \n\
                                                    \n\
                                                      \n\
                                  /\\                \n\
                                 /  \\           \n\
                          ＿ -  -    -   ―--                      \n\
                              |                                  \n\
                      /                      \\                   \n\
                             /                          \n\
                                                                \n\
                     |        /              /                   \n\
                                                                \n\
                                    ＿――--￣                    \n\
                                                                 \n\
                                                                 \n\
                  엔 진    시 작    중                           \n\
                                                                \
", "\
                                                                 \n\
                                                    \n\
                                                      \n\
                   /            __              \n\
                  /            /  \\       \n\
               |               | ·|== \n\
               |         ======\\__/                         \n\
               |        /        |                               \n\
                \\      ∥         \\                                \n\
                       ∥         /                        \n\
                        \\        /                                \n\
                         ========                                 \n\
                          =    =               ______                   \n\
                                       ＿――--￣                    \n\
                                                                 \n\
                  엔 진    시 작    중 .                         \n\
                                                                \
", "\
                                                                 \n\
                                                    \n\
                                                                 \n\
                                                                 \n\
                                                      \n\
                     /            __              \n\
                                 /  \\       \n\
                 |               | ·|== \n\
                           ======\\__/                         \n\
                          /        |                               \n\
                         ∥         \\                                \n\
                         ∥         /                        \n\
                          \\        /                                \n\
                           ========                                 \n\
                            =    =                                      \n\
                  엔 진    시 작    중 . .                       \n\
                                                                \
"
];

for(frm of frms)
{
	for(chr of frm)
	{
		ret.push(chr.charCodeAt());  // 아스키 코드 저장
	}
	ret.push(0x0A);  // 줄 바꾸기
}

ret.push(1);  // 파일 끝

fs.writeFileSync('chick.tcv', String.fromCharCode.apply(null, ret), 'utf8');